app/Controllers/Producto.php

SELECT *
FROM `producto`
WHERE `producto`.`deleted_at` IS NULL
---
    public function index(): string
    {

        $productoM = model('ProductoM');
        $data ['productos']  = $productoM->findAll();